Autodesk.Revit.DB.ForgeDM.CloudProject.GetFolders
Gets all top-level folders that are available to current login user from this Project.
Returns:
The list of Folders.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
Could be any reasons related to network.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified cloud project.
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudProject.GetHub
Gets ForgeDM Hub of this Project.
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudProject.GUID
RCM Project GUID of this Project.
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudProject.Name
Name of this Project.
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudProject.Id
Identifier of this Project.
Remarks:
Forge Project id = "b." + BIM 360 Docs or Autodesk Docs Project id. For example, b.b0524685-6a33-4004-9537-0e0535c58624
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudProject.#ctor(Autodesk.Revit.DB.ForgeDM.CloudHub,System.String,System.String,System.Guid)
Constructor for CloudProject.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudProject.#ctor(System.String,System.String,System.Guid)
Constructor for CloudProject.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudProject.#ctor(Autodesk.Revit.DB.ForgeDM.CloudProject)
For communication between Revit and Collaborate add-in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudProject
This class represents a Project from ForgeDM
Since:
2022